[Killed] ObjectLiteral
src/RTK/test-utils.tsx:31:33
     return <Provider store={store}>{children}</Provider>;
   }
 
-  return { store, ...render(ui, { wrapper: Wrapper, ...renderOptions }) }
+  return { store, ...render(ui, {}) }
 }
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


PASS src/RTK/RTK.test.ts

PASS src/components/Button/Button.test.tsx (6.102 s)
