[Killed] BooleanLiteral
src/RTK/gameSlice.ts:8:12
   width: 20,
   height: 20,
   boxesMatrix: generateLand(20, 20),
-  running: false,
+  running: true,
 };
 
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts

  ● RTK › Set clear action

[Killed] BlockStatement
src/RTK/gameSlice.ts:18:10
     setBoxState: (
       state = initialState,
       action: PayloadAction<{ x: number; y: number }>,
-    ) => {
-      const { x, y } = action.payload;
-      const value = state.boxesMatrix[x][y];
-      state.boxesMatrix[x][y] = value ? 0 : 1;
-    },
+    ) => {},
     clearLand: (state = initialState) => {
       state.boxesMatrix = generateLand(state.width, state.height);
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts

  ● RTK › Set box state action

[Killed] BlockStatement
src/RTK/gameSlice.ts:23:42
       const value = state.boxesMatrix[x][y];
       state.boxesMatrix[x][y] = value ? 0 : 1;
     },
-    clearLand: (state = initialState) => {
-      state.boxesMatrix = generateLand(state.width, state.height);
-    },
+    clearLand: (state = initialState) => {},
     nextTick: (state = initialState) => {
       state.boxesMatrix = landTick(state.boxesMatrix);
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts

  ● RTK › Set clear action

[Killed] BlockStatement
src/RTK/gameSlice.ts:26:41
     clearLand: (state = initialState) => {
       state.boxesMatrix = generateLand(state.width, state.height);
     },
-    nextTick: (state = initialState) => {
-      state.boxesMatrix = landTick(state.boxesMatrix);
-    },
+    nextTick: (state = initialState) => {},
     // modifyRunning: (state = initialState, action) => {
     //   state.running = action.payload;
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts

  ● RTK › Set next tick action

[Killed] BlockStatement
src/RTK/gameSlice.ts:32:42
     // modifyRunning: (state = initialState, action) => {
     //   state.running = action.payload;
     // },
-    setRandom: (state = initialState) => {
-      state.boxesMatrix = generateLand(state.width, state.height, true);
-    },
+    setRandom: (state = initialState) => {},
   },
 });
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts

  ● RTK › Set random action

[Killed] BooleanLiteral
src/RTK/gameSlice.ts:33:67
     //   state.running = action.payload;
     // },
     setRandom: (state = initialState) => {
-      state.boxesMatrix = generateLand(state.width, state.height, true);
+      state.boxesMatrix = generateLand(state.width, state.height, false);
     },
   },
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts

  ● RTK › Set random action
