[Survived] StringLiteral
src/components/Box/Box.stories.tsx:13:20
   argTypes: {
     isLife: {
       type: 'boolean',
-      description: 'Флаг жизни',
+      description: "",
       options: [false, true],
       control: {

[Survived] BooleanLiteral
src/components/Box/Box.stories.tsx:14:24
     isLife: {
       type: 'boolean',
       description: 'Флаг жизни',
-      options: [false, true],
+      options: [false, false],
       control: {
         type: 'radio',

[Survived] BooleanLiteral
src/components/Box/Box.stories.tsx:14:17
     isLife: {
       type: 'boolean',
       description: 'Флаг жизни',
-      options: [false, true],
+      options: [true, true],
       control: {
         type: 'radio',

[Survived] ObjectLiteral
src/components/Box/Box.stories.tsx:15:16
       type: 'boolean',
       description: 'Флаг жизни',
       options: [false, true],
-      control: {
-        type: 'radio',
-      },
+      control: {},
     },
     x: {

[Survived] ObjectLiteral
src/components/Box/Box.stories.tsx:19:8
         type: 'radio',
       },
     },
-    x: {
-      type: 'number',
-      description: 'Координата по оси X',
-    },
+    x: {},
     y: {
       type: 'number',

[Survived] StringLiteral
src/components/Box/Box.stories.tsx:21:20
     },
     x: {
       type: 'number',
-      description: 'Координата по оси X',
+      description: "",
     },
     y: {

[Survived] ObjectLiteral
src/components/Box/Box.stories.tsx:23:8
       type: 'number',
       description: 'Координата по оси X',
     },
-    y: {
-      type: 'number',
-      description: 'Координата по оси Y',
-    },
+    y: {},
   },
   decorators: [

[Survived] StringLiteral
src/components/Box/Box.stories.tsx:25:20
     },
     y: {
       type: 'number',
-      description: 'Координата по оси Y',
+      description: "",
     },
   },

[Survived] ArrowFunction
src/components/Box/Box.stories.tsx:29:5
     },
   },
   decorators: [
-    (Story) => (
-      <Provider store={store}>
-        <Story />
-      </Provider>
-    ),
+    () => undefined,
   ],
 };

[Survived] ArrowFunction
src/components/Box/Box.stories.tsx:37:18
   ],
 };
 
-const Template = (arg) => <Box {...arg} />;
+const Template = () => undefined;
 
 export const Default = Template.bind({});
