[Survived] StringLiteral
src/components/Button/Button.stories.tsx:5:10
 import Button from './Button';
 
 export default {
-  title: 'Button',
+  title: "",
   component: Button,
   argTypes: {

[Survived] StringLiteral
src/components/Button/Button.stories.tsx:10:20
   argTypes: {
     text: {
       type: 'string',
-      description: 'Кнопка',
+      description: "",
       default: 'Button',
     },

[Survived] StringLiteral
src/components/Button/Button.stories.tsx:11:16
     text: {
       type: 'string',
       description: 'Кнопка',
-      default: 'Button',
+      default: "",
     },
     onClick: {

[Survived] ArrowFunction
src/components/Button/Button.stories.tsx:20:18
   },
 };
 
-const Template = (arg) => <Button {...arg} />;
+const Template = () => undefined;
 
 export const Default = Template.bind({});

[Survived] StringLiteral
src/components/Button/Button.stories.tsx:23:43
 const Template = (arg) => <Button {...arg} />;
 
 export const Default = Template.bind({});
-Default.args = { name: 'Storybook', text: 'My button' };
+Default.args = { name: 'Storybook', text: "" };
 
