[Survived] ObjectLiteral
src/components/Panel/Panel.stories.tsx:6:16
 import { store } from '../../RTK/store';
 import Panel from '../Panel/Panel';
 
-export default {
-  title: 'Panel',
-  component: Panel,
-  decorators: [
-    (Story) => (
-      <Provider store={store}>
-        <Story />
-      </Provider>
-    ),
-  ],
-};
+export default {};
 
 const Template = (arg) => <Panel {...arg} />;

[Survived] ArrowFunction
src/components/Panel/Panel.stories.tsx:18:18
   ],
 };
 
-const Template = (arg) => <Panel {...arg} />;
+const Template = () => undefined;
 
 export const Default = Template.bind({});
