[Survived] StringLiteral
src/components/Land/Land.stories.tsx:7:10
 import Land from './Land';
 
 export default {
-  title: 'Land',
+  title: "",
   component: Land,
   decorators: [

[Survived] ArrowFunction
src/components/Land/Land.stories.tsx:18:18
   ],
 };
 
-const Template = (arg) => <Land {...arg} />;
+const Template = () => undefined;
 
 export const Default = Template.bind({});
