[Survived] BlockStatement
src/RTK/store.ts:18:72
   game: gameSlice,
 });
 
-export function setupStore(preloadedState?: PreloadedState<RootState>) {
-  return configureStore({
-    reducer: rootReducer,
-    preloadedState,
-  });
-}
+export function setupStore(preloadedState?: PreloadedState<RootState>) {}
 
 export type RootState = ReturnType<typeof rootReducer>;
