[Survived] ObjectLiteral
src/components/Row/Row.stories.tsx:13:14
   title: 'Row',
   component: Row,
   argTypes: {
-    content: {
-      type: 'Array',
-      description: 'Контент для отрисовки блоков',
-    },
+    content: {},
     order: {
       type: 'number',

[Survived] StringLiteral
src/components/Row/Row.stories.tsx:18:13
       description: 'Контент для отрисовки блоков',
     },
     order: {
-      type: 'number',
+      type: "",
       description:
         'Порядковый индекс строки (не влияет на визуальную часть, используется при создании и обновлении игрового поля)',

[Survived] ArrowFunction
src/components/Row/Row.stories.tsx:32:18
   ],
 };
 
-const Template = (arg) => <Row {...arg} />;
+const Template = () => undefined;
 
 export const Default = Template.bind({});
