[Survived] ArrowFunction
src/components/Box/styles.tsx:10:23
   height: 30px;
   border: 1px solid darkslategrey;
   border-radius: 2px;
-  background-color: ${({ isLife }) => (isLife ? 'green' : 'white')};
+  background-color: ${() => undefined};
   margin: 2px;
 `;

[Survived] StringLiteral
src/components/Box/styles.tsx:10:49
   height: 30px;
   border: 1px solid darkslategrey;
   border-radius: 2px;
-  background-color: ${({ isLife }) => (isLife ? 'green' : 'white')};
+  background-color: ${({ isLife }) => (isLife ? "" : 'white')};
   margin: 2px;
 `;
