[Survived] StringLiteral
src/components/Button/Button.tsx:10:41
   click: () => void;
 };
 
-const Button = ({ name = 'Name', text = 'Button', click }: ButtonPropsType) => {
+const Button = ({ name = 'Name', text = "", click }: ButtonPropsType) => {
   return (
     <button className="btn" onClick={click} key={`${name}-${text}`}>
