[Survived] ArrowFunction
src/components/Land/Land.tsx:15:21
   return (
     <div className="land">
       <div>
-        {matrix.map((elm, index) => (
-          <Row key={index} content={elm} order={index}></Row>
-        ))}
+        {matrix.map(() => undefined)}
       </div>
     </div>
