[Killed] BlockStatement
src/components/Panel/Panel.tsx:11:22
   const dispatch = useAppDispatch();
   let timer;
 
-  const next = () => {
-    dispatch(nextTick());
-  };
+  const next = () => {};
 
   const run = () => {
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


PASS src/RTK/RTK.test.ts

PASS src/components/Button/Button.test.tsx (6.685 s)

[Killed] BlockStatement
src/components/Panel/Panel.tsx:15:21
     dispatch(nextTick());
   };
 
-  const run = () => {
-    timer = setInterval(() => {
-      next();
-    }, 400);
-  };
+  const run = () => {};
 
   const stop = () => {
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


PASS src/RTK/RTK.test.ts

PASS src/components/Button/Button.test.tsx (6.39 s)

[Killed] BlockStatement
src/components/Panel/Panel.tsx:16:31
   };
 
   const run = () => {
-    timer = setInterval(() => {
-      next();
-    }, 400);
+    timer = setInterval(() => {}, 400);
   };
 
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


PASS src/RTK/RTK.test.ts

PASS src/components/Button/Button.test.tsx (5.926 s)

[Survived] BlockStatement
src/components/Panel/Panel.tsx:21:22
     }, 400);
   };
 
-  const stop = () => {
-    clearInterval(timer);
-  };
+  const stop = () => {};
 
   const clear = () => {

[Killed] BlockStatement
src/components/Panel/Panel.tsx:25:23
     clearInterval(timer);
   };
 
-  const clear = () => {
-    dispatch(clearLand());
-  };
+  const clear = () => {};
 
   const random = () => {
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


PASS src/RTK/RTK.test.ts

PASS src/components/Button/Button.test.tsx (6.375 s)

[Killed] BlockStatement
src/components/Panel/Panel.tsx:29:24
     dispatch(clearLand());
   };
 
-  const random = () => {
-    dispatch(setRandom());
-  };
+  const random = () => {};
 
   return (
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


PASS src/RTK/RTK.test.ts

PASS src/components/Button/Button.test.tsx (6.61 s)
