[Killed] ArrowFunction
src/components/Row/Row.tsx:13:20
 export const Row = ({ content, order }: RowPropsType) => {
   return (
     <div className="row" role="RowRole">
-      {content.map((isLife, index) => (
-        <Box
-          isLife={!!isLife}
-          x={order}
-          y={index}
-          key={`${order}-${index}`}
-        ></Box>
-      ))}
+      {content.map(() => undefined)}
     </div>
   );
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


PASS src/RTK/RTK.test.ts

PASS src/components/Button/Button.test.tsx (6.368 s)

[Survived] BooleanLiteral
src/components/Row/Row.tsx:15:20
     <div className="row" role="RowRole">
       {content.map((isLife, index) => (
         <Box
-          isLife={!!isLife}
+          isLife={!isLife}
           x={order}
           y={index}
