[Killed] BlockStatement
src/components/Box/Box.tsx:11:24
 const Box = ({ isLife, x, y }: BoxPropsType) => {
   const dispatch = useAppDispatch();
 
-  const update = () => {
-    dispatch(setBoxState({ x, y }));
-  };
+  const update = () => {};
 
   return <StyledBox isLife={isLife} onClick={update} role="BoxRole" />;
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


PASS src/RTK/RTK.test.ts

PASS src/components/Button/Button.test.tsx (6.399 s)
