[Killed] EqualityOperator
src/helpers/methods.ts:4:19
 export const landTick = (life: number[][]) => {
   const newLife = [];
 
-  for (let i = 0; i < life.length; i++) {
+  for (let i = 0; i <= life.length; i++) {
     const rowLife = life[i];
     const newLifeRow = [];
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts (5.137 s)

  ● RTK › Set next tick action

[Killed] UpdateOperator
src/helpers/methods.ts:4:36
 export const landTick = (life: number[][]) => {
   const newLife = [];
 
-  for (let i = 0; i < life.length; i++) {
+  for (let i = 0; i < life.length; i--) {
     const rowLife = life[i];
     const newLifeRow = [];
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts

  ● RTK › Set next tick action

[Timeout] UpdateOperator
src/helpers/methods.ts:8:41
     const rowLife = life[i];
     const newLifeRow = [];
 
-    for (let j = 0; j < rowLife.length; j++) {
+    for (let j = 0; j < rowLife.length; j--) {
       const cell = rowLife[j];
       const aa = life[i - 1];

[Survived] EqualityOperator
src/helpers/methods.ts:8:21
     const rowLife = life[i];
     const newLifeRow = [];
 
-    for (let j = 0; j < rowLife.length; j++) {
+    for (let j = 0; j <= rowLife.length; j++) {
       const cell = rowLife[j];
       const aa = life[i - 1];

[Survived] ArithmeticOperator
src/helpers/methods.ts:10:23
 
     for (let j = 0; j < rowLife.length; j++) {
       const cell = rowLife[j];
-      const aa = life[i - 1];
+      const aa = life[i + 1];
       const cc = life[i + 1];
 

[Survived] ArithmeticOperator
src/helpers/methods.ts:11:23
     for (let j = 0; j < rowLife.length; j++) {
       const cell = rowLife[j];
       const aa = life[i - 1];
-      const cc = life[i + 1];
+      const cc = life[i - 1];
 
       let a1 = 0;

[Survived] ArithmeticOperator
src/helpers/methods.ts:16:26
       let a1 = 0;
       let a2 = 0;
       let a3 = 0;
-      const b1 = rowLife[j - 1] ? 1 : 0;
+      const b1 = rowLife[j + 1] ? 1 : 0;
       const b3 = rowLife[j + 1] ? 1 : 0;
       let c1 = 0;

[Survived] ArithmeticOperator
src/helpers/methods.ts:17:26
       let a2 = 0;
       let a3 = 0;
       const b1 = rowLife[j - 1] ? 1 : 0;
-      const b3 = rowLife[j + 1] ? 1 : 0;
+      const b3 = rowLife[j - 1] ? 1 : 0;
       let c1 = 0;
       let c2 = 0;

[Killed] ConditionalExpression
src/helpers/methods.ts:22:11
       let c2 = 0;
       let c3 = 0;
 
-      if (aa && aa.length) {
+      if (true) {
         a1 = aa[j - 1] ? 1 : 0;
         a2 = aa[j] ? 1 : 0;
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts

  ● RTK › Set next tick action

[Killed] LogicalOperator
src/helpers/methods.ts:22:11
       let c2 = 0;
       let c3 = 0;
 
-      if (aa && aa.length) {
+      if (aa || aa.length) {
         a1 = aa[j - 1] ? 1 : 0;
         a2 = aa[j] ? 1 : 0;
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts
  ● RTK › Set next tick action

    TypeError: Cannot read properties of undefined (reading 'length')

[Survived] ArithmeticOperator
src/helpers/methods.ts:23:17
       let c3 = 0;
 
       if (aa && aa.length) {
-        a1 = aa[j - 1] ? 1 : 0;
+        a1 = aa[j + 1] ? 1 : 0;
         a2 = aa[j] ? 1 : 0;
         a3 = aa[j + 1] ? 1 : 0;

[Survived] ArithmeticOperator
src/helpers/methods.ts:25:17
       if (aa && aa.length) {
         a1 = aa[j - 1] ? 1 : 0;
         a2 = aa[j] ? 1 : 0;
-        a3 = aa[j + 1] ? 1 : 0;
+        a3 = aa[j - 1] ? 1 : 0;
       }
 

[Killed] ConditionalExpression
src/helpers/methods.ts:28:11
         a3 = aa[j + 1] ? 1 : 0;
       }
 
-      if (cc && cc.length) {
+      if (true) {
         c1 = cc[j - 1] ? 1 : 0;
         c2 = cc[j] ? 1 : 0;
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts
  ● RTK › Set next tick action

    TypeError: Cannot read properties of undefined (reading '-1')

[Killed] LogicalOperator
src/helpers/methods.ts:28:11
         a3 = aa[j + 1] ? 1 : 0;
       }
 
-      if (cc && cc.length) {
+      if (cc || cc.length) {
         c1 = cc[j - 1] ? 1 : 0;
         c2 = cc[j] ? 1 : 0;
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts (5.072 s)

  ● RTK › Set next tick action

[Survived] ArithmeticOperator
src/helpers/methods.ts:29:17
       }
 
       if (cc && cc.length) {
-        c1 = cc[j - 1] ? 1 : 0;
+        c1 = cc[j + 1] ? 1 : 0;
         c2 = cc[j] ? 1 : 0;
         c3 = cc[j + 1] ? 1 : 0;

[Survived] ArithmeticOperator
src/helpers/methods.ts:31:17
       if (cc && cc.length) {
         c1 = cc[j - 1] ? 1 : 0;
         c2 = cc[j] ? 1 : 0;
-        c3 = cc[j + 1] ? 1 : 0;
+        c3 = cc[j - 1] ? 1 : 0;
       }
 

[Survived] ArithmeticOperator
src/helpers/methods.ts:34:25
         c3 = cc[j + 1] ? 1 : 0;
       }
 
-      const neighbors = a1 + a2 + a3 + b1 + b3 + c1 + c2 + c3;
+      const neighbors = a1 + a2 - a3 + b1 + b3 + c1 + c2 + c3;
 
       if (cell && neighbors < 2) {

[Survived] ArithmeticOperator
src/helpers/methods.ts:34:25
         c3 = cc[j + 1] ? 1 : 0;
       }
 
-      const neighbors = a1 + a2 + a3 + b1 + b3 + c1 + c2 + c3;
+      const neighbors = a1 + a2 + a3 + b1 + b3 + c1 - c2 + c3;
 
       if (cell && neighbors < 2) {

[Survived] LogicalOperator
src/helpers/methods.ts:36:11
 
       const neighbors = a1 + a2 + a3 + b1 + b3 + c1 + c2 + c3;
 
-      if (cell && neighbors < 2) {
+      if (cell || neighbors < 2) {
         newLifeRow.push(0);
       } else if (cell && neighbors >= 2 && neighbors <= 3) {

[Survived] ConditionalExpression
src/helpers/methods.ts:36:19
 
       const neighbors = a1 + a2 + a3 + b1 + b3 + c1 + c2 + c3;
 
-      if (cell && neighbors < 2) {
+      if (cell && true) {
         newLifeRow.push(0);
       } else if (cell && neighbors >= 2 && neighbors <= 3) {

[Survived] EqualityOperator
src/helpers/methods.ts:38:26
 
       if (cell && neighbors < 2) {
         newLifeRow.push(0);
-      } else if (cell && neighbors >= 2 && neighbors <= 3) {
+      } else if (cell && neighbors > 2 && neighbors <= 3) {
         newLifeRow.push(1);
       } else if (cell && neighbors > 3) {

[Survived] ConditionalExpression
src/helpers/methods.ts:38:18
 
       if (cell && neighbors < 2) {
         newLifeRow.push(0);
-      } else if (cell && neighbors >= 2 && neighbors <= 3) {
+      } else if (false) {
         newLifeRow.push(1);
       } else if (cell && neighbors > 3) {

[Survived] BlockStatement
src/helpers/methods.ts:40:41
         newLifeRow.push(0);
       } else if (cell && neighbors >= 2 && neighbors <= 3) {
         newLifeRow.push(1);
-      } else if (cell && neighbors > 3) {
-        newLifeRow.push(0);
-      } else if (!cell && neighbors === 3) {
+      } else if (cell && neighbors > 3) {} else if (!cell && neighbors === 3) {
         newLifeRow.push(1);
       } else {

[Survived] ConditionalExpression
src/helpers/methods.ts:40:26
         newLifeRow.push(0);
       } else if (cell && neighbors >= 2 && neighbors <= 3) {
         newLifeRow.push(1);
-      } else if (cell && neighbors > 3) {
+      } else if (cell && true) {
         newLifeRow.push(0);
       } else if (!cell && neighbors === 3) {

[Survived] LogicalOperator
src/helpers/methods.ts:42:18
         newLifeRow.push(1);
       } else if (cell && neighbors > 3) {
         newLifeRow.push(0);
-      } else if (!cell && neighbors === 3) {
+      } else if (!cell || neighbors === 3) {
         newLifeRow.push(1);
       } else {

[Survived] ConditionalExpression
src/helpers/methods.ts:42:18
         newLifeRow.push(1);
       } else if (cell && neighbors > 3) {
         newLifeRow.push(0);
-      } else if (!cell && neighbors === 3) {
+      } else if (false) {
         newLifeRow.push(1);
       } else {

[Survived] BlockStatement
src/helpers/methods.ts:44:14
         newLifeRow.push(0);
       } else if (!cell && neighbors === 3) {
         newLifeRow.push(1);
-      } else {
-        newLifeRow.push(0);
-      }
+      } else {}
     }
 

[Killed] BooleanLiteral
src/helpers/methods.ts:58:12
 export const generateLand = (
   width = 10,
   height = 10,
-  random = false,
+  random = true,
 ): number[][] => {
   const result = [];
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts

  ● RTK › Set clear action

[Killed] BlockStatement
src/helpers/methods.ts:62:36
 ): number[][] => {
   const result = [];
 
-  for (let i = 0; i < height; i++) {
-    const row = [];
-    for (let j = 0; j < width; j++) {
-      row.push(random ? Math.round(Math.random()) : 0);
-    }
-
-    result.push(row);
-  }
+  for (let i = 0; i < height; i++) {}
 
   return result;
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/components/Panel/Panel.test.tsx

  ● Console

[Killed] ConditionalExpression
src/helpers/methods.ts:62:19
 ): number[][] => {
   const result = [];
 
-  for (let i = 0; i < height; i++) {
+  for (let i = 0; false; i++) {
     const row = [];
     for (let j = 0; j < width; j++) {
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts

  ● RTK › Set random action

[Killed] BlockStatement
src/helpers/methods.ts:64:37
 
   for (let i = 0; i < height; i++) {
     const row = [];
-    for (let j = 0; j < width; j++) {
-      row.push(random ? Math.round(Math.random()) : 0);
-    }
+    for (let j = 0; j < width; j++) {}
 
     result.push(row);
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts

  ● RTK › Set random action

[Killed] ConditionalExpression
src/helpers/methods.ts:64:21
 
   for (let i = 0; i < height; i++) {
     const row = [];
-    for (let j = 0; j < width; j++) {
+    for (let j = 0; false; j++) {
       row.push(random ? Math.round(Math.random()) : 0);
     }
killedBy: All tests
statusReason: > game-of-life@1.0.0 test
> jest --config=jest.config.js --no-cache --coverage


FAIL src/RTK/RTK.test.ts

  ● RTK › Set random action
