[Timeout] ConditionalExpression
src/helpers/methods.ts:4:19
 export const landTick = (life: number[][]) => {
   const newLife = [];
 
-  for (let i = 0; i < life.length; i++) {
+  for (let i = 0; false; i++) {
     const rowLife = life[i];
     const newLifeRow = [];

[Timeout] ConditionalExpression
src/helpers/methods.ts:22:11
       let c2 = 0;
       let c3 = 0;
 
-      if (aa && aa.length) {
+      if (false) {
         a1 = aa[j - 1] ? 1 : 0;
         a2 = aa[j] ? 1 : 0;

[Timeout] ConditionalExpression
src/helpers/methods.ts:28:11
         a3 = aa[j + 1] ? 1 : 0;
       }
 
-      if (cc && cc.length) {
+      if (false) {
         c1 = cc[j - 1] ? 1 : 0;
         c2 = cc[j] ? 1 : 0;

[Timeout] EqualityOperator
src/helpers/methods.ts:62:19
 ): number[][] => {
   const result = [];
 
-  for (let i = 0; i < height; i++) {
+  for (let i = 0; i <= height; i++) {
     const row = [];
     for (let j = 0; j < width; j++) {
